zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/samd51/atsamd51j19a-pinctrl.h
/* pa24f_tcc2_wo2 */
#define PA24F_TCC2_WO2 MCHP_PINMUX(a, 24, f, periph)

/* pa24g_pdec_qdi0 */
#define PA24G_PDEC_QDI0 MCHP_PINMUX(a, 24, g, periph)

/* pa24h_usb_dm */
#define PA24H_USB_DM MCHP_PINMUX(a, 24, h, periph)

/* pa24n_ccl_in8 */
#define PA24N_CCL_IN8 MCHP_PINMUX(a, 24, n, periph)

/* pa25_gpio */
#define PA25_GPIO MCHP_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint9 */
#define PA25A_EIC_EXTINT9 MCHP_PINMUX(a, 25, a, periph)

/* pa25c_sercom3_pad3 */
#define PA25C_SERCOM3_PAD3 MCHP_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad3 */
#define PA25D_SERCOM5_PAD3 MCHP_PINMUX(a, 25, d, periph)

/* pa25e_tc5_wo1 */
#define PA25E_TC5_WO1 MCHP_PINMUX(a, 25, e, periph)

/* pa25g_pdec_qdi1 */
#define PA25G_PDEC_QDI1 MCHP_PINMUX(a, 25, g, periph)

/* pa25h_usb_dp */
#define PA25H_USB_DP MCHP_PINMUX(a, 25, h, periph)

/* pa25n_ccl_out2 */
#define PA25N_CCL_OUT2 MCHP_PINMUX(a, 25, n, periph)

/* pa27_gpio */
#define PA27_GPIO MCHP_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint11 */
#define PA27A_EIC_EXTINT11 MCHP_PINMUX(a, 27, a, periph)

/* pa27b_adc0_x18 */
#define PA27B_ADC0_X18 MCHP_PINMUX(a, 27, b, periph)

/* pa27b_adc0_y18 */
#define PA27B_ADC0_Y18 MCHP_PINMUX(a, 27, b, periph)

/* pa27m_gclk_io1 */
#define PA27M_GCLK_IO1 MCHP_PINMUX(a, 27, m, periph)

/* pa30_gpio */
#define PA30_GPIO MCHP_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint14 */
#define PA30A_EIC_EXTINT14 MCHP_PINMUX(a, 30, a, periph)

/* pa30b_adc0_x19 */
#define PA30B_ADC0_X19 MCHP_PINMUX(a, 30, b, periph)

/* pa30b_adc0_y19 */
#define PA30B_ADC0_Y19 MCHP_PINMUX(a, 30, b, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 MCHP_PINMUX(a, 30, d, periph)

/* pa30f_tcc2_wo0 */
#define PA30F_TCC2_WO0 MCHP_PINMUX(a, 30, f, periph)

/* pa30m_gclk_io0 */
#define PA30M_GCLK_IO0 MCHP_PINMUX(a, 30, m, periph)

/* pa30n_ccl_in3 */
#define PA30N_CCL_IN3 MCHP_PINMUX(a, 30, n, periph)

/* pa31_gpio */
#define PA31_GPIO MCHP_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint15 */
#define PA31A_EIC_EXTINT15 MCHP_PINMUX(a, 31, a, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 MCHP_PINMUX(a, 31, d, periph)

/* pa31f_tcc2_wo1 */
#define PA31F_TCC2_WO1 MCHP_PINMUX(a, 31, f, periph)

/* pa31n_ccl_out1 */
#define PA31N_CCL_OUT1 MCHP_PINMUX(a, 31, n, periph)

/* pb0_gpio */
#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

/* pb0a_eic_extint0 */
#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

/* pb0b_adc0_ain12 */
#define PB0B_ADC0_AIN12 MCHP_PINMUX(b, 0, b, periph)

/* pb0b_adc0_x30 */
#define PB0B_ADC0_X30 MCHP_PINMUX(b, 0, b, periph)

/* pb0b_adc0_y30 */
#define PB0B_ADC0_Y30 MCHP_PINMUX(b, 0, b, periph)

/* pb0d_sercom5_pad2 */
#define PB0D_SERCOM5_PAD2 MCHP_PINMUX(b, 0, d, periph)

/* pb0n_ccl_in1 */
#define PB0N_CCL_IN1 MCHP_PINMUX(b, 0, n, periph)

/* pb1_gpio */
#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

/* pb1a_eic_extint1 */
#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

/* pb1b_adc0_ain13 */
#define PB1B_ADC0_AIN13 MCHP_PINMUX(b, 1, b, periph)

/* pb1b_adc0_x31 */
#define PB1B_ADC0_X31 MCHP_PINMUX(b, 1, b, periph)

/* pb1b_adc0_y31 */
#define PB1B_ADC0_Y31 MCHP_PINMUX(b, 1, b, periph)

/* pb1d_sercom5_pad3 */
#define PB1D_SERCOM5_PAD3 MCHP_PINMUX(b, 1, d, periph)

/* pb1n_ccl_in2 */
#define PB1N_CCL_IN2 MCHP_PINMUX(b, 1, n, periph)

/* pb2_gpio */
#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain14 */
#define PB2B_ADC0_AIN14 MCHP_PINMUX(b, 2, b, periph)

/* pb2b_adc0_x20 */
#define PB2B_ADC0_X20 MCHP_PINMUX(b, 2, b, periph)

/* pb2b_adc0_y20 */
#define PB2B_ADC0_Y20 MCHP_PINMUX(b, 2, b, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 MCHP_PINMUX(b, 2, d, periph)

/* pb2f_tcc2_wo2 */
#define PB2F_TCC2_WO2 MCHP_PINMUX(b, 2, f, periph)

/* pb2n_ccl_out0 */
#define PB2N_CCL_OUT0 MCHP_PINMUX(b, 2, n, periph)

/* pb3_gpio */
#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain15 */
#define PB3B_ADC0_AIN15 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_x21 */
#define PB3B_ADC0_X21 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_y21 */
#define PB3B_ADC0_Y21 MCHP_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 MCHP_PINMUX(b, 3, d, periph)

/* pb4_gpio */
#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

/* pb4b_adc0_x22 */
#define PB4B_ADC0_X22 MCHP_PINMUX(b, 4, b, periph)

/* pb4b_adc0_y22 */
#define PB4B_ADC0_Y22 MCHP_PINMUX(b, 4, b, periph)

/* pb4b_adc1_ain6 */
#define PB4B_ADC1_AIN6 MCHP_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

/* pb5b_adc0_x23 */
#define PB5B_ADC0_X23 MCHP_PINMUX(b, 5, b, periph)

/* pb5b_adc0_y23 */
#define PB5B_ADC0_Y23 MCHP_PINMUX(b, 5, b, periph)

/* pb5b_adc1_ain7 */
#define PB5B_ADC1_AIN7 MCHP_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

/* pb6b_adc0_x24 */
#define PB6B_ADC0_X24 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_adc0_y24 */
#define PB6B_ADC0_Y24 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_adc1_ain8 */
#define PB6B_ADC1_AIN8 MCHP_PINMUX(b, 6, b, periph)

/* pb6n_ccl_in6 */
#define PB6N_CCL_IN6 MCHP_PINMUX(b, 6, n, periph)

/* pb7_gpio */
#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

/* pb7b_adc0_x25 */
#define PB7B_ADC0_X25 MCHP_PINMUX(b, 7, b, periph)

/* pb7b_adc0_y25 */
#define PB7B_ADC0_Y25 MCHP_PINMUX(b, 7, b, periph)

/* pb7b_adc1_ain9 */
#define PB7B_ADC1_AIN9 MCHP_PINMUX(b, 7, b, periph)

/* pb7n_ccl_in7 */
#define PB7N_CCL_IN7 MCHP_PINMUX(b, 7, n, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

